students/w11/d05/classwork/my_blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all