students/w12/classwork/robot_factory/app/controllers/robots_controller.rb

SELECT "robots".* FROM "robots"
---
  def index
    @robots = Robot.all

SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @robot = Robot.find_by(id: params[:id])

INSERT INTO "robots" ("name", "avatar", "serial", "skill", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    new_robot = Robot.new(permitted_params)
    if new_robot.save

SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "robots" SET "name" = $1, "avatar" = $2, "skill" = $3, "serial" = $4, "updated_at" = $5 WHERE "robots"."id" = $6
---
  def update
    found_robot = Robot.find_by_id(params[:id])
    saved = found_robot.update(permitted_params)

SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "robots" WHERE "robots"."id" = $1  [["id", 11]]
---
  def destroy
    found_robot = Robot.find_by_id(params[:id])
    if found_robot.destroy!