students/w12/classwork/robot_factory/app/controllers/tasks_controller.rb

  def index
# create var found_robot by the id parameter
    found_robot = Robot.find_by_id(params[:robot_id])
---
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
# create var found_robot by the id parameter
    found_robot = Robot.find_by_id(params[:robot_id])
---
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    task = found_robot.tasks.find_by_id(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["robot_id", 14], ["id", 8], ["LIMIT", 1]]

  def create
    found_robot = Robot.find_by_id(params[:robot_id])
# variable new task is assigned the value of class Task with the .new method and takes permitted params
    new_task = Task.new(permitted_params)
# the robot found by id has it's tasks accessed with .tasks, << pushes a new item into the .tasks array - could possibly also be a .push
    found_robot.tasks << new_task
---
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "description", "completed", "robot_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Homework 2"], ["description", "stupid homework"], ["completed", false], ["robot_id", 14], ["created_at", 2016-12-05 20:22:19 UTC], ["updated_at", 2016-12-05 20:22:19 UTC]]

  def update
    found_robot = Robot.find_by_id(params[:robot_id])
---
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    task = found_robot.tasks.find_by_id(params[:id])
# saved is assigned the value of a task with permitted params
    saved = task.update(permitted_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["robot_id", 14], ["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "stupider homework"], ["updated_at", 2016-12-05 20:35:12 UTC], ["id", 8]]

  def destroy
    found_robot = Robot.find_by_id(params[:robot_id])
    task = found_robot.tasks.find_by_id(params[:id])
    deleted = task.destroy
---
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["robot_id", 14], ["id", 8], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 8]]